artillery/load_test.yml
config:
  target: "https://w3pyaln7g8.execute-api.us-east-1.amazonaws.com/Prod/"
  phases:
    - name : "Warm up"
      duration: 60
      arrivalRate: 10
    - name: "Ramp up"
      duration: 300
      arrivalRate: 20
      rampTo: 100
    - name: "Sustained"
      duration: 600
      arrivalRate: 20
  defaults:
    headers:
      Content-Type: "application/json"
#  payload:
#    path: "./payload.json"

scenarios:
  - name: "Load Test Scenario"
    flow:
      - post:
          url: "/detect"
          json:
            "session_id": 123895
            "image_url": "https://proctor360.s3.amazonaws.com/test/ai/6246_JCZoILhks1JkbO45r2MG_1724248639.jpg"
            "bucket_name": "proctor360"
            "organisation_id": "12345"
            "session_link": "vs12345"
            "exam_id": "12345"
            "student_session_id": 12345
            "source_image": "face_photo/0067ZGCDO3e0TrUXzXFR-1588545008791-1588545006906.png"